##  Modifying Data: Adding and Dropping Columns and Rows

In [1]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35]
}
df = pd.DataFrame(data)

In [2]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [3]:
df['City'] = ['New York', 'Los Angeles', 'Chicago']

In [4]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [5]:
df['Age Group'] = ['Young' if age < 30 else 'Mature' for age in df['Age']]

In [6]:
df

      Name  Age         City Age Group
0    Alice   25     New York     Young
1      Bob   30  Los Angeles    Mature
2  Charlie   35      Chicago    Mature

In [7]:
df = df.drop('Age Group', axis=1)

In [8]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [9]:
df = df.drop(1)

In [10]:
df

      Name  Age      City
0    Alice   25  New York
2  Charlie   35   Chicago

In [11]:
df_copy = df.copy()

In [12]:
df_copy

      Name  Age      City
0    Alice   25  New York
2  Charlie   35   Chicago

In [13]:
df = df.assign(Discount=[5, 10], Total_Spend=[100, 200])

In [14]:
df

      Name  Age      City  Discount  Total_Spend
0    Alice   25  New York         5          100
2  Charlie   35   Chicago        10          200

## Accessing Data: Using df.iloc[] and df.loc[]

In [15]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Seattle']
}
df = pd.DataFrame(data)

In [16]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45      Seattle

In [17]:
row = df.loc[2]
row

Name    Charlie
Age          35
City    Chicago
Name: 2, dtype: object

In [18]:
cell = df.loc[3, 'City']
cell

'Houston'

In [19]:
subset_rows = df.loc[1:3]
subset_rows

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In [20]:
subset = df.loc[1:4, ['Name', 'City']]
subset

      Name         City
1      Bob  Los Angeles
2  Charlie      Chicago
3    David      Houston
4      Eva      Seattle

In [21]:
mask = df['Age'] > 30
filtered = df.loc[mask].iloc[:, 0]
filtered

2    Charlie
3      David
4        Eva
Name: Name, dtype: object

In [22]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45      Seattle

In [23]:
df.iloc[1:4]

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

##  Sampling and Previewing Data: Using df.sample() and df.head()

In [24]:
import pandas as pd
df = pd.read_csv('model_logs.csv')

In [25]:
df.head(3)

,Date,Prompt,Response Time (ms),Tokens Generated
0,2023-01-01,Generate a creative story about space travel,62,287
1,2023-01-02,Write a sci-fi short story set in 2050,45,361
2,2023-01-03,Write a poem about the future of technology,33,221

In [26]:
random_row = df.sample()
random_row

,Date,Prompt,Response Time (ms),Tokens Generated
98,2023-04-09,Generate marketing copy for a new tech product,77,296

In [27]:
random_rows = df.sample(n=3)
random_rows

,Date,Prompt,Response Time (ms),Tokens Generated
64,2023-03-06,Outline the ethical considerations of AI,51,269
80,2023-03-22,Explain blockchain for beginners,90,226
52,2023-02-22,Describe the impact of AI on healthcare,90,416

In [28]:
random_sample = df.sample(n=5, random_state=67)
random_sample

,Date,Prompt,Response Time (ms),Tokens Generated
17,2023-01-18,Generate a creative story about space travel,61,484
24,2023-01-25,Describe the impact of AI on healthcare,97,271
64,2023-03-06,Outline the ethical considerations of AI,51,269
93,2023-04-04,Explain quantum computing in simple terms,97,325
97,2023-04-08,Write a poem about the future of technology,38,465

In [29]:
fraction_sample = df.sample(frac=0.3)
fraction_sample

,Date,Prompt,Response Time (ms),Tokens Generated
39,2023-02-09,Outline the ethical considerations of AI,33,286
68,2023-03-10,Explain blockchain for beginners,59,316
10,2023-01-11,Generate a creative story about space travel,98,230
31,2023-02-01,Explain quantum computing in simple terms,42,265
37,2023-02-07,Write a poem about the future of technology,70,306
62,2023-03-04,Explain quantum computing in simple terms,42,219
36,2023-02-06,Summarize the latest research on climate change,94,324
91,2023-04-02,Explain quantum computing in simple terms,69,462
28,2023-01-29,Create a recipe using plant-based ingredients,97,257
46,2023-02-16,Describe the impact of AI on healthcare,73,302
35,2023-02-05,Summarize the latest research on climate change,64,205
33,2023-02-03,Write a poem about the future of technology,97,283
53,2023-02-23,Generate marketing copy for a new tech product,74,318
3,2023-01-04,Explain quantum computing in simple terms,53,290
23,2023-01-24,Outline the ethical considerations of AI,53,301
66,2023-03-08,Generate a creative story about space travel,70,379
24,2023-01-25,Describe the impact of AI on healthcare,97,271
8,2023-01-09,Generate marketing copy for a new tech product,96,427
26,2023-01-27,Explain blockchain for beginners,67,314
76,2023-03-18,Generate marketing copy for a new tech product,91,329
56,2023-02-26,Summarize the latest research on climate change,86,500
16,2023-01-17,Generate marketing copy for a new tech product,91,225
42,2023-02-12,Outline the ethical considerations of AI,41,499
94,2023-04-05,Summarize the latest research on climate change,41,500
93,2023-04-04,Explain quantum computing in simple terms,97,325
22,2023-01-23,Write a poem about the future of technology,94,210
89,2023-03-31,Explain blockchain for beginners,78,490
73,2023-03-15,Explain blockchain for beginners,91,293
18,2023-01-19,Outline the ethical considerations of AI,78,242
41,2023-02-11,Describe the impact of AI on healthcare,99,437

## Filtering Data: Masks and pandas.Series.between()

In [30]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami']
}
df = pd.DataFrame(data)

In [31]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45        Miami

In [32]:
mask = df['Age'] > 30

In [33]:
mask

0    False
1    False
2     True
3     True
4     True
Name: Age, dtype: bool

In [34]:
filtered_df = df[mask]
filtered_df

      Name  Age     City
2  Charlie   35  Chicago
3    David   40  Houston
4      Eva   45    Miami

In [35]:
mask = (df['Age'] > 30) & (df['City'] != 'Houston')
filtered_df = df[mask]
filtered_df

      Name  Age     City
2  Charlie   35  Chicago
4      Eva   45    Miami

In [36]:
mask

0    False
1    False
2     True
3    False
4     True
dtype: bool

### pandas.Series.between()

In [37]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45        Miami

In [38]:
filtered_df = df[df['Age'].between(30, 40)]
filtered_df

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In [39]:
mask = df['City'].isin(['Chicago', 'Houston'])
filtered_df = df[mask]
filtered_df

      Name  Age     City
2  Charlie   35  Chicago
3    David   40  Houston

## Sorting Data

In [40]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami']
}
df = pd.DataFrame(data)

In [41]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45        Miami

In [42]:
sorted_df = df.sort_values(by='Age')
sorted_df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45        Miami

In [43]:
sorted_df = df.sort_values(by='Age', ascending=False)
sorted_df

      Name  Age         City
4      Eva   45        Miami
3    David   40      Houston
2  Charlie   35      Chicago
1      Bob   30  Los Angeles
0    Alice   25     New York

In [44]:
sorted_df = df.sort_values(by=['City', 'Age'])
sorted_df

      Name  Age         City
2  Charlie   35      Chicago
3    David   40      Houston
1      Bob   30  Los Angeles
4      Eva   45        Miami
0    Alice   25     New York

In [45]:
sorted_df = df.sort_index()
sorted_df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45        Miami

In [46]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45        Miami

In [47]:
df.sort_values(by='Age', ascending=False, inplace=True)

In [48]:
df

      Name  Age         City
4      Eva   45        Miami
3    David   40      Houston
2  Charlie   35      Chicago
1      Bob   30  Los Angeles
0    Alice   25     New York

In [49]:
# Example DataFrame: Player leaderboard with names and scores
data = {
    'Player': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
    'Score': [150, 200, 125, 300, 175]
}
df = pd.DataFrame(data)
df

    Player  Score
0    Alice    150
1      Bob    200
2  Charlie    125
3    Diana    300
4      Eve    175

In [50]:
sorted_df = df.sort_values(by='Score', ascending=False).reset_index(drop=True)
sorted_df['Rank'] = sorted_df.index + 1
sorted_df

    Player  Score  Rank
0    Diana    300     1
1      Bob    200     2
2      Eve    175     3
3    Alice    150     4
4  Charlie    125     5

## Handling Missing Data

In [51]:
import pandas as pd
# Sample DataFrame with missing values
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'Age': [25, None, 35, 40],
    'City': ['New York', 'Los Angeles', None, 'Houston']
}
df = pd.DataFrame(data)

In [52]:
df

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2  Charlie  35.0         None
3    Diana  40.0      Houston

In [53]:
df.isnull()

    Name    Age   City
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False

In [54]:
df.isna()

    Name    Age   City
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False

In [55]:
df_cleaned = df.dropna()
df_cleaned

    Name   Age      City
0  Alice  25.0  New York
3  Diana  40.0   Houston

In [56]:
df

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2  Charlie  35.0         None
3    Diana  40.0      Houston

In [57]:
df_cleaned = df.dropna(axis=1)
df_cleaned

      Name
0    Alice
1      Bob
2  Charlie
3    Diana

In [58]:
df

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2  Charlie  35.0         None
3    Diana  40.0      Houston

In [59]:
df['Age'] = df['Age'].fillna(df['Age'].mean())

In [60]:
df

      Name        Age         City
0    Alice  25.000000     New York
1      Bob  33.333333  Los Angeles
2  Charlie  35.000000         None
3    Diana  40.000000      Houston

In [61]:
df['City'] = df['City'].fillna('Unknown')

In [62]:
df

      Name        Age         City
0    Alice  25.000000     New York
1      Bob  33.333333  Los Angeles
2  Charlie  35.000000      Unknown
3    Diana  40.000000      Houston

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      float64
 2   City    4 non-null      object
dtypes: float64(1), object(2)
memory usage: 228.0+ bytes

## Aggregations and Grouping Data

In [64]:
import pandas as pd
# Sample DataFrame
data = {
    'Category': ['Electronics', 'Electronics', 'Furniture', 'Furniture', 'Apparel'],
    'Product': ['Laptop', 'Mouse', 'Chair', 'Table', 'Shoes'],
    'Sales': [1200, 100, 400, 300, 50]
}
df = pd.DataFrame(data)

In [65]:
df

      Category Product  Sales
0  Electronics  Laptop   1200
1  Electronics   Mouse    100
2    Furniture   Chair    400
3    Furniture   Table    300
4      Apparel   Shoes     50

In [66]:
grouped = df.groupby('Category')['Sales'].sum().reset_index()
grouped

      Category  Sales
0      Apparel     50
1  Electronics   1300
2    Furniture    700

In [67]:
grouped = df.groupby(['Category', 'Product'])['Sales'].sum()
grouped

Category     Product
Apparel      Shoes        50
Electronics  Laptop     1200
             Mouse       100
Furniture    Chair       400
             Table       300
Name: Sales, dtype: int64

In [68]:
summary = df.groupby('Category')['Sales'].agg(['sum',  'mean', 'count'])
summary

              sum   mean  count
Category
Apparel        50   50.0      1
Electronics  1300  650.0      2
Furniture     700  350.0      2